{"pages":[],"posts":[{"title":"丧或者现充吧","permalink":"http://yoursite.com/2016/12/27/丧或者现充吧/","text":"追过廿月，追不过自己丧或者现充吧tag: 学习笔记，日常随便 什么是丧？什么是现充丧、现充，考究源头的话，也是外来词，源自霓虹（日本）对同一阶段（通常是高中生，大学生）生活状态的具象描写。就如同字面想要表达的那样丧，本身就是有着负面含义————丢掉，失去，萎靡，而被称之为生活太丧的人们，大意也就是生活没有意义，没有目标，没有个人追求的人们；现充，简单来说，现实生活充实者，不只是所谓的工作充实，而是有追求，有意义，丰富多彩的代名词；举个比较现实的例子的话，苏同学每天除去适当的学业，开心的工作以外，多出的时间依旧会参与或者被邀请参与一些活动，生活被绘制的五彩缤纷，让人看上去就充满羡慕的状态；而木同学呢，每天要面对不得已的学业，揪心亦或麻木的工作，每天24刻的时间区分，除去前者，剩下的只考虑像北京胡同里的葛大爷一样躺着，没有朋友和女朋友，生活在雾霾或者晴空万里的世界都像机器一般，那么大体就可以被归类为丧了。 但是丧和现充并不是相对的这只是目前较为普遍的生活态度中的两种，也是其他人在进行群体划分时不知道哪里浮现出来的大众标准罢了，就好像，文青，愤青，x丝，年薪百万群体一样，只是一个可以供选择的标签，利于自己和他人进行分类。拇指上下一划，发现，“某乎，起步985，最低211，月薪都是普通工作人员，谈年薪才有资本谈人生，生活不是所谓的人生四大俗，便是所谓谦虚的现充”“微博上，大V们早上还在北京一环道声早安，下午就可能在他国广场上投食喂鸽子顺便还完成一天的工作”，生活被太多的现充充斥，让人们不自觉的把自己这样正常的生活状态归类为丧。假期休假，在家玩游戏，感觉生活的太丧；没有利用好工作学习之外的8h，感觉是丧；没有和朋友聚会party，也要大呼丧；没有健身自我升华，那么就对现充更是望尘莫及了。世界明明很大，却被网络勾连的很小，无论是我们关注亦或不关注的东西，都在算法和推送中飘到我们的眼前（不关注的基本也就被算法剥离了(￣▽￣)”），过完自己一天的生活，却被迫发现一种区别于自己、不同于自己的世界，还要努力向他看齐，紧接着就充满罪恶感，紧迫感，好似被过弯漂移的车甩出了驾驶舱。但是，也许要静下心来思考一番，我们真的坐在那辆车上吗？并不是说不思进取，而是应该学会找到自己的目标和追求，倘若现充的世界的确是个人精神诉求和物质追求，那么无可厚非，大步向前，迎头赶上，争取望其项背；不过，所谓的现充的和丧，都只是生活态度的一种标签罢了，倘若强行要相中一个贴在背上，等着撕掉或者贴上另一个自己根本不需要的标签，那么被压的像只猴子一样，也是很有可能的，搞不好还能上上热门"},{"title":"Hexo '+' Github 搭建个人 blog 基本套路","permalink":"http://yoursite.com/2016/12/23/Hexo + Github-搭建个人blog基本套路/","text":"搭建环境[] 安装 git ————用于同步本地以及服务器端文件，简言之，至于为什么用这么高大上的东西？都打算自己搭建blog了，版本控制器对于更新纠正数据也会便捷许多[] 安装 nodeJs ———— Hexo 的 blog 框架是依赖nodeJs这个包的，没有 nodeJs，blog 没有框架就好像漂移的车没了车架[x] 以上安装都是满足本地的 blog 书写环境，以及日后搭建的平台能显得有格调，内涵 服务端需求[] github 能为个人用户提供300M的存储空间，用作个人 blog 数据管理，所以还是偏向使用 github，不过目前国内两大云厂商都有一堆福利，觉得麻烦的话，也可以使用这两家的，企鹅家的优惠还行，有各种优惠券，阿里家的满足基础消费可以免费用半年，加上消费的也基本够用了[] 这里还是会侧重 github pages[] GitHub Pages 本用于介绍托管在 GitHub 的项目， 不过，由于他的空间免费稳定，用来做搭建一个博客再好不过了。[] github pages 可以在开始创建第一个项目后，setting 生成 github pages[] 生成后，可以得到 ‘yourname.github.io’ 的网址，这边是个人博客页面 配置Hexo[] 在完成上述步骤后可以去以下网站： Hexo官网或者链接 https://hexo.io/zh-cn/在 cmd 窗口，或者 powershell 窗口， linux 的 terminal 中进行如下命令安装配置12345npm install hexo-cli -ghexo init blogcd blognpm installhexo server [] 当然，建议安装前可以先查看文档，明白基础命令及其意义[] 完成上述配置，便可以使用 http://localhost:4000/ 预览目前安装完成后的博客界面[] 接下来便是，魔改 Hexo ，实现个人主题，在之后根据文档创建文章即可 配置 Deployment，部署上传内容[] 首先，配置自己的git身份信息，也就是将本地的 Hexo 和 github.io 链接, yourname 就是作者名字（不一定要和github一致）， youremail 则是github 的邮箱12git config --global user.name &quot;yourname&quot;git config --global user.email &quot;youremail&quot; 同样在_config.yml（ hexo 的 blog 文件夹中）文件中，找到Deployment，然后按照如下修改：1234deploy: type: git repo: git@github.com:yourname/yourname.github.io.git branch: master [] 文章编辑完成后，利用12hexo cleanhexo -d g 即可完成部署，如果提前配置好git，此处就直接输入密码，否则按照提示分别输入自己的Github账号用户名和密码，开始上传。 然后通过’http://yourname.github.io/&#39;来访问自己刚刚上传的网站。‘( •̀ ω •́ )y’"},{"title":"Hello World","permalink":"http://yoursite.com/2016/12/22/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment"}]}